# FluidFailures Properties

---
The BuiltInFailuresFluidFailures type exposes the following members.
| Name| Description
---|---|---
| UndefinedFluidType|  The fluid type '[Type Name]' is not defined
Top
#### Reference
BuiltInFailuresFluidFailures Class
Autodesk.Revit.DB Namespace